#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ПустаяСтрока(Параметры.АдресДереваОтбораКонфигураций)
		 Или Не ЭтоАдресВременногоХранилища(Параметры.АдресДереваОтбораКонфигураций) Тогда
		ТекстОшибки = НСтр("ru = 'Отбор конфигураций можно открыть только, передав адрес дерева отбора конфигураций.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;

	Дерево = ПолучитьИзВременногоХранилища(Параметры.АдресДереваОтбораКонфигураций);
	УдалитьИзВременногоХранилища(Параметры.АдресДереваОтбораКонфигураций);
	ЗначениеВДанныеФормы(Дерево, ДеревоОтбораКонфигураций);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоОтбораКонфигураций

&НаКлиенте
Процедура ДеревоОтбораКонфигурацийПометкаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ДеревоОтбораКонфигураций.ТекущиеДанные;
	Если ТекущиеДанные.Пометка = 2 Тогда
		ТекущиеДанные.Пометка = 0;
	КонецЕсли;

	Родитель = ТекущиеДанные.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		ОбработатьИзменениеПометкиЭлементаВерхнегоУровня(ТекущиеДанные);
	Иначе
		ОбработатьИзменениеПометкиЭлементаНижнегоУровня(ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СброситьОтбор(Команда)

	ЭлементыДерева = ДеревоОтбораКонфигураций.ПолучитьЭлементы();
	Если ЭлементыДерева.Количество() > 0 Тогда
		ТекущиеДанные = ЭлементыДерева[0];
		ТекущиеДанные.Пометка = 1;
		ОбработатьИзменениеПометкиЭлементаВерхнегоУровня(ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор(Команда)

	ЕстьПомеченные = Ложь;
	ЭлементыДерева = ДеревоОтбораКонфигураций.ПолучитьЭлементы();
	Для Каждого Элемент Из ЭлементыДерева Цикл
		Если Элемент.Пометка <> 0 Тогда
			ЕстьПомеченные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьПомеченные Тогда
		Закрыть(АдресДереваОтбораКонфигураций());
	Иначе
		ТекстОшибки = НСтр("ru = 'Нужно выбрать хотя бы одну конфигурацию для отбора.'");
		УИ_ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьИзменениеПометкиЭлементаВерхнегоУровня(ТекущиеДанные)

	Если ТекущиеДанные.Пометка = 1 Тогда
		СнятьПометкиКромеТекущегоЭлементаВерхнегоУровня(ТекущиеДанные);
	КонецЕсли;
	ИзменитьПометкиЭлементовРодителя(ТекущиеДанные, ТекущиеДанные.Пометка);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеПометкиЭлементаНижнегоУровня(ТекущиеДанные)

	Родитель = ТекущиеДанные.ПолучитьРодителя();
	ЕстьПомеченные = Ложь;
	ЕстьНепомеченные = Ложь;
	Для Каждого Элемент Из Родитель.ПолучитьЭлементы() Цикл
		Если Элемент.Пометка = 1 Тогда
			ЕстьПомеченные = Истина;
		ИначеЕсли Элемент.Пометка = 0 Тогда
			ЕстьНепомеченные = Истина;
		Иначе
			ВызватьИсключение НСтр("ru = 'Установлено непредусмотренное состояние пометки.'");
		КонецЕсли;
	КонецЦикла;
	Если ЕстьПомеченные И ЕстьНепомеченные Тогда
		Родитель.Пометка = 2;
		СнятьПометкиКромеТекущегоЭлементаВерхнегоУровня(Родитель);
	ИначеЕсли ЕстьПомеченные Тогда
		Родитель.Пометка = 1;
		СнятьПометкиКромеТекущегоЭлементаВерхнегоУровня(Родитель);
	Иначе
		Родитель.Пометка = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкиКромеТекущегоЭлементаВерхнегоУровня(ТекущиеДанные)

	ТекущаяСтрока = ТекущиеДанные.ПолучитьИдентификатор();
	ВерхнийУровень = ДеревоОтбораКонфигураций.ПолучитьЭлементы();
	Для Каждого Элемент Из ВерхнийУровень Цикл
		Если Элемент.ПолучитьИдентификатор() = ТекущаяСтрока Тогда
			Продолжить;
		КонецЕсли;
		Элемент.Пометка = 0;
		ИзменитьПометкиЭлементовРодителя(ТекущиеДанные, Элемент.Пометка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПометкиЭлементовРодителя(Родитель, НоваяПометка)

	ЭлементыРодителя = Родитель.ПолучитьЭлементы();
	Для Каждого Элемент Из ЭлементыРодителя Цикл
		Элемент.Пометка = НоваяПометка;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция АдресДереваОтбораКонфигураций()

	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоОтбораКонфигураций");
	Адрес = ПоместитьВоВременноеХранилище(ДеревоЗначений);
	Возврат Адрес;

КонецФункции

#КонецОбласти