#Область ОписаниеПеременных

&НаСервере
Перем ЭлементыСтруктурыКонфигурации;

&НаСервере
Перем КартинкиЭлементовСтруктурыКонфигурации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьСтруктуруКонфигурации();
	ЗаполнитьДеревоОтбораКонфигураций();

	УИ_ОбщегоНазначения.ФормаИнструментаПриСозданииНаСервере(ЭтотОбъект,
															 Отказ,
															 СтандартнаяОбработка,
															 Элементы.ДеревоОбъектовМетаданных.КоманднаяПанель);

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ЗаполнитьДеревоОбъектовМетаданных();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоОбъектовМетаданных

&НаКлиенте
Процедура ДеревоОбъектовМетаданныхПередРазворачиванием(Элемент, Строка, Отказ)

	ТекущиеДанные = ДеревоОбъектовМетаданных.НайтиПоИдентификатору(Строка);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.ЗаполнитьКоллекциюМетаданных Тогда
		ДеревоОбъектовМетаданныхПередРазворачиваниемНаСервере(Строка);
	КонецЕсли;
	Элементы.ДеревоОбъектовМетаданных.ТекущаяСтрока = Строка;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовМетаданныхПриАктивизацииСтроки(Элемент)
	УстановитьДоступностьКнопокДереваОбъектов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОтборКонфигураций(Команда)

	Оповещение = Новый ОписаниеОповещения("ОткрытьОтборКонфигурацийЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("АдресДереваОтбораКонфигураций", АдресДереваОтбораКонфигураций());
	ОткрытьФорму("Обработка.УИ_НавигаторПоМетаданным.Форма.ФормаОтбораКонфигураций",
				 ПараметрыОткрытия,
				 ЭтотОбъект,
				 УникальныйИдентификатор,
				 ,
				 ,
				 Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъектСписокМетаданных(Команда)

	ТекущиеДанные = Элементы.ДеревоОбъектовМетаданных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Позиция = СтрНайти(ТекущиеДанные.ПолноеИмя, ".");
	Если Позиция > 0 Тогда
		ИмяБазовогоТипа = Лев(ТекущиеДанные.ПолноеИмя, Позиция - 1);
	Иначе
		ТекстОшибки = НСтр("ru = 'Не удалось получить базовый тип по полному имени метаданных.'");
		УИ_ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;

	ТипыСФормойСписка = Новый Массив;
	ТипыСФормойСписка.Добавить("Справочник");
	ТипыСФормойСписка.Добавить("Документ");
	ТипыСФормойСписка.Добавить("БизнесПроцесс");
	ТипыСФормойСписка.Добавить("Задача");
	ТипыСФормойСписка.Добавить("ПланСчетов");
	ТипыСФормойСписка.Добавить("ПланОбмена");
	ТипыСФормойСписка.Добавить("ПланВидовХарактеристик");
	ТипыСФормойСписка.Добавить("ПланВидовРасчета");
	ТипыСФормойСписка.Добавить("Перечисление");
	ТипыСФормойСписка.Добавить("ЖурналДокументов");
	ТипыСФормойСписка.Добавить("РегистрСведений");
	ТипыСФормойСписка.Добавить("РегистрНакопления");
	ТипыСФормойСписка.Добавить("РегистрБухгалтерии");
	ТипыСФормойСписка.Добавить("РегистрРасчета");

	Если ТипыСФормойСписка.Найти(ИмяБазовогоТипа) <> Неопределено Тогда
		Если ИспользоватьФормуСпискаИнструмента И ИмяБазовогоТипа <> "Перечисление" Тогда
			УИ_ОбщегоНазначенияКлиент.ОткрытьДинамическийСписок(ТекущиеДанные.ПолноеИмя);
		Иначе
			ИмяФормыОткрытия = СтрШаблон("%1.ФормаСписка", ТекущиеДанные.ПолноеИмя);
			ОткрытьФорму(ИмяФормыОткрытия);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	ТипыСФормой = Новый Массив;
	ТипыСФормой.Добавить("Обработка");
	ТипыСФормой.Добавить("Отчет");
	Если ТипыСФормой.Найти(ИмяБазовогоТипа) <> Неопределено Тогда
		ИмяФормыОткрытия = СтрШаблон("%1.Форма", ТекущиеДанные.ПолноеИмя);
		ОткрытьФорму(ИмяФормыОткрытия);
		Возврат;
	КонецЕсли;

	Если ИмяБазовогоТипа = "Константа" Тогда
		ИмяФормыОткрытия = СтрШаблон("%1.ФормаКонстант", ТекущиеДанные.ПолноеИмя);
		ОткрытьФорму(ИмяФормыОткрытия);
		Возврат;
	КонецЕсли;

	Если ИмяБазовогоТипа = "ОбщаяФорма" Тогда
		ОткрытьФорму(ТекущиеДанные.ПолноеИмя);
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВИзбранные(Команда)

	ТекущиеДанные = Элементы.ДеревоОбъектовМетаданных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ПустаяСтрока(ТекущиеДанные.ПолноеИмя) Тогда
		Возврат;
	КонецЕсли;

	СтруктураПоиска = КолонкиУникальностиОбъектаМетаданных();
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущиеДанные);
	НайденныеСтроки = ИзбранныеОбъектыМетаданных.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;

	НоваяСтрока = ИзбранныеОбъектыМетаданных.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);

	УзелИзбранные = УзелИзбранные(ДеревоОбъектовМетаданных);
	Если УзелИзбранные = Неопределено Тогда
		ИмяУзлаИзбранные = ИмяУзлаИзбранные();
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось найти узел ""%1"".'"), ИмяУзлаИзбранные);
		УИ_ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;

	ЭлементыУзла = УзелИзбранные.ПолучитьЭлементы();
	НовыйЭлемент = ЭлементыУзла.Добавить();
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, НоваяСтрока);
	УзелИзбранные.КоличествоЭлементов = ИзбранныеОбъектыМетаданных.Количество();

КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзИзбранных(Команда)

	ТекущиеДанные = Элементы.ДеревоОбъектовМетаданных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ПустаяСтрока(ТекущиеДанные.ПолноеИмя) Тогда
		Возврат;
	КонецЕсли;

	СтруктураПоиска = КолонкиУникальностиОбъектаМетаданных();
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущиеДанные);
	НайденныеСтроки = ИзбранныеОбъектыМетаданных.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаИзбранного Из НайденныеСтроки Цикл
		ИзбранныеОбъектыМетаданных.Удалить(СтрокаИзбранного);
	КонецЦикла;

	УзелИзбранные = УзелИзбранные(ДеревоОбъектовМетаданных);
	Если УзелИзбранные = Неопределено Тогда
		ИмяУзлаИзбранные = ИмяУзлаИзбранные();
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось найти узел ""%1"".'"), ИмяУзлаИзбранные);
		УИ_ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;

	СтрокиДляУдаления = Новый Массив;
	ЭлементыУзла = УзелИзбранные.ПолучитьЭлементы();
	Для Каждого Элемент Из ЭлементыУзла Цикл
		ДанныеСовпадают = Истина;
		Для Каждого КлючЗначение Из СтруктураПоиска Цикл
			Если Элемент[КлючЗначение.Ключ] <> КлючЗначение.Значение Тогда
				ДанныеСовпадают = Ложь;
			КонецЕсли;
		КонецЦикла;
		Если ДанныеСовпадают Тогда
			СтрокиДляУдаления.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Элемент Из СтрокиДляУдаления Цикл
		ЭлементыУзла.Удалить(Элемент);
	КонецЦикла;
	УзелИзбранные.КоличествоЭлементов = ИзбранныеОбъектыМетаданных.Количество();

КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоОбъектов(Команда)

	ЭлементыДерева = ДеревоОбъектовМетаданных.ПолучитьЭлементы();
	СвернутьДеревоОбъектовРекурсивно(Элементы.ДеревоОбъектовМетаданных, ЭлементыДерева);
	Если ЭлементыДерева.Количество() > 0 Тогда
		Элементы.ДеревоОбъектовМетаданных.ТекущаяСтрока = ЭлементыДерева[0].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоОбъектовМетаданных()

	ДанныеПоОтборуКонфигураций = ДанныеПоОтборуКонфигураций();
	ДеревоОбъектов = РеквизитФормыВЗначение("ДеревоОбъектовМетаданных");
	ЗаполнитьОбъектыМетаданных(ДеревоОбъектов, ДанныеПоОтборуКонфигураций);
	ЗначениеВРеквизитФормы(ДеревоОбъектов, "ДеревоОбъектовМетаданных");

КонецПроцедуры

&НаСервере
Функция ДанныеПоОтборуКонфигураций()

	ВыбранныйРодитель = Неопределено;
	ЭлементыДерева = ДеревоОтбораКонфигураций.ПолучитьЭлементы();
	Для Каждого Элемент Из ЭлементыДерева Цикл
		Если Элемент.Пометка <> 0 Тогда
			ВыбранныйРодитель = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если ВыбранныйРодитель = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Некорректно указан отбор по конфигурациям.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Результат = Новый Массив;
	Если ВыбранныйРодитель.Пометка = 1 Тогда
		ДанныеКонфигурации = ДанныеКонфигурации(ВыбранныйРодитель);
		Результат.Добавить(ДанныеКонфигурации);
	Иначе
		АктивныеРасширения = АктивныеРасширения();
		ЭлементыРодителя = ВыбранныйРодитель.ПолучитьЭлементы();
		Для Каждого Элемент Из ЭлементыРодителя Цикл
			Если Элемент.Пометка = 1 Тогда
				ДанныеРасширения = ДанныеКонфигурации(Элемент, АктивныеРасширения);
				Результат.Добавить(ДанныеРасширения);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДанныеКонфигурации(ТекущиеДанные, СписокРасширений = Неопределено)

	Результат = Новый Структура;
	Результат.Вставить("Имя", ТекущиеДанные.Имя);
	Результат.Вставить("Метаданные", Неопределено);
	Результат.Вставить("ДеревоОбъектовМетаданных", Неопределено);
	Результат.Вставить("Идентификатор", ТекущиеДанные.ПолучитьИдентификатор());
	Результат.Вставить("КэшЭлементов", Новый Соответствие);
	Результат.Вставить("КэшУзлов", Новый Соответствие);

	ЕстьРодитель = (ТекущиеДанные.ПолучитьРодителя() <> Неопределено);
	Если ЭтоАдресВременногоХранилища(ТекущиеДанные.АдресМетаданных) Тогда
		ДвоичныеДанныеМетаданных = ПолучитьИзВременногоХранилища(ТекущиеДанные.АдресМетаданных);
		МетаданныеКонфигурации = Новый ОбъектМетаданныхКонфигурация(ДвоичныеДанныеМетаданных);
		Результат.Метаданные = МетаданныеКонфигурации;
	ИначеЕсли ТекущиеДанные.ЭтоТекущаяБазаДанных Тогда
		Если ЕстьРодитель Тогда
			Если СписокРасширений = Неопределено Тогда
				СписокРасширений = АктивныеРасширения(ТекущиеДанные.Имя);
			КонецЕсли;
			Расширение = НайтиРасширениеПоИмени(СписокРасширений, ТекущиеДанные.Имя);
			ДанныеРасширения = Расширение.ПолучитьДанные();
			МетаданныеРасширения = Новый ОбъектМетаданныхКонфигурация(ДанныеРасширения);
			Результат.Метаданные = МетаданныеРасширения;
			ТекущиеДанные.АдресМетаданных = ПоместитьВоВременноеХранилище(ДанныеРасширения,
																		  УникальныйИдентификатор);
		Иначе
			МетаданныеКонфигурации = Метаданные;
			Результат.Метаданные = МетаданныеКонфигурации;
		КонецЕсли;
	Иначе
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Для конфигурации ""%1"" не сохранились данные метаданных.'"),
								ТекущиеДанные.Имя);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Если ЭтоАдресВременногоХранилища(ТекущиеДанные.АдресДереваОбъектовМетаданных) Тогда
		Результат.ДеревоОбъектовМетаданных = ПолучитьИзВременногоХранилища(ТекущиеДанные.АдресДереваОбъектовМетаданных);
	Иначе
		ДеревоОбъектов = СоздатьДеревоОбъектов();
		ИнициализироватьОбъектыМетаданных(ДеревоОбъектов, Результат.Метаданные);
		ТекущиеДанные.АдресДереваОбъектовМетаданных = ПоместитьВоВременноеХранилище(ДеревоОбъектов,
																					УникальныйИдентификатор);
		Результат.ДеревоОбъектовМетаданных = ДеревоОбъектов;
	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаСервере
Функция СоздатьДеревоОбъектов()

	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоОбъектовМетаданных");
	ДеревоЗначений.Строки.Очистить();
	Возврат ДеревоЗначений;

КонецФункции

&НаСервере
Процедура ЗаполнитьОбъектыМетаданных(ДеревоМетаданных, ДанныеПоОтборуКонфигураций)

	ЭлементыДерева = ДеревоМетаданных.Строки;
	ЭлементыДерева.Очистить();
	
	ЗаполнитьИзбранныеОбъектыМетаданныхВДеревеОбъектов(ДеревоМетаданных);	
	
	ОднаКонфигурация = (ДанныеПоОтборуКонфигураций.Количество() = 1);

	КэшУзлов = Новый Соответствие;
	Для Каждого ОписаниеЭлемента Из СтруктураКонфигурации Цикл
		Узел = УзелМетаданныхДерева(ДеревоМетаданных, ОписаниеЭлемента, КэшУзлов);
		Если Узел = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЭлементыУзла = Узел.Строки;

		НоваяСтрока = ЭлементыУзла.Добавить();
		Если ОписаниеЭлемента.Имя = ЭлементыСтруктурыКонфигурации.Конфигурация Тогда
			Если ОднаКонфигурация Тогда
				СтрокаДанныхОтбораКонфигурации = ДанныеПоОтборуКонфигураций[0];
				ОбъектКонфигурация = ОбъектМетаданныхДерева(СтрокаДанныхОтбораКонфигурации.ДеревоОбъектовМетаданных,
															ОписаниеЭлемента,
															СтрокаДанныхОтбораКонфигурации.КэшЭлементов,
															СтрокаДанныхОтбораКонфигурации.КэшУзлов);
				Если ОбъектКонфигурация = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ОбъектКонфигурация);
			Иначе
				НоваяСтрока.Имя = ОписаниеЭлемента.Представление;
				НоваяСтрока.ИмяЭлементаСтруктурыКонфигурации = ОписаниеЭлемента.Имя;
				СписокКонфигураций = НоваяСтрока.Строки;
				Для Каждого СтрокаДанных Из ДанныеПоОтборуКонфигураций Цикл
					ОбъектКонфигурация = ОбъектМетаданныхДерева(СтрокаДанных.ДеревоОбъектовМетаданных,
																ОписаниеЭлемента,
																СтрокаДанных.КэшЭлементов,
																СтрокаДанных.КэшУзлов);
					НоваяКонфигурация = СписокКонфигураций.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяКонфигурация, ОбъектКонфигурация);
				КонецЦикла;
			КонецЕсли;
		Иначе
			НоваяСтрока.Имя = ОписаниеЭлемента.Представление;
			НоваяСтрока.ИмяЭлементаСтруктурыКонфигурации = ОписаниеЭлемента.Имя;
			НоваяСтрока.Картинка = КартинкиЭлементовСтруктурыКонфигурации[ОписаниеЭлемента.Имя];
		КонецЕсли;
		Если ОписаниеЭлемента.ЕстьКоллекция Тогда
			КоличествоКонфигурацийКЗаполнению = 0;
			КоличествоЭлементов = 0;
			КэшСтрокПриемника = КэшСтрокУзлаДерева(НоваяСтрока.Строки);
			Для Каждого СтрокаДанных Из ДанныеПоОтборуКонфигураций Цикл
				ОбъектКонфигурация = ОбъектМетаданныхДерева(СтрокаДанных.ДеревоОбъектовМетаданных,
															ОписаниеЭлемента,
															СтрокаДанных.КэшЭлементов,
															СтрокаДанных.КэшУзлов);
				ДополнитьКоллекциюОбъектаМетаданных(НоваяСтрока.Строки, ОбъектКонфигурация.Строки, КэшСтрокПриемника);
				КоличествоЭлементов = КоличествоЭлементов + ОбъектКонфигурация.КоличествоЭлементов;
				КоличествоКонфигурацийКЗаполнению = (КоличествоКонфигурацийКЗаполнению
													 + ОбъектКонфигурация.ЗаполнитьКоллекциюМетаданных);
			КонецЦикла;
			НоваяСтрока.ЗаполнитьКоллекциюМетаданных = Булево(КоличествоКонфигурацийКЗаполнению);
			Если КоличествоКонфигурацийКЗаполнению < 2 Тогда
				НоваяСтрока.КоличествоЭлементов = КоличествоЭлементов;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьКоллекциюОбъектаМетаданных(КоллекцияМетаданныхПриемник, КоллекцияМетаданныхИсточник,
	КэшСтрокПриемника)

	ЭтоПриемникДанныеФормы = (ТипЗнч(КоллекцияМетаданныхПриемник) = Тип("ДанныеФормыКоллекцияЭлементовДерева"));
	СтруктураПоиска = КолонкиУникальностиОбъектаМетаданных();
	Для Каждого СтрокаИсточник Из КоллекцияМетаданныхИсточник Цикл
		Если ПустаяСтрока(СтрокаИсточник.ПолноеИмя) Тогда
			Продолжить;
		КонецЕсли;
		КлючПоиска = КлючСтрокиКэша(СтруктураПоиска, СтрокаИсточник);
		РезультатПоиска = КэшСтрокПриемника[КлючПоиска];

		Если РезультатПоиска = Неопределено Тогда
			НоваяСтрока = КоллекцияМетаданныхПриемник.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);
			ДобавитьСтрокуКэша(КэшСтрокПриемника, КлючПоиска);
			Если СтрокаИсточник.Строки.Количество() > 0 Тогда
				Если ЭтоПриемникДанныеФормы Тогда
					ДополнитьКоллекциюОбъектаМетаданных(НоваяСтрока.ПолучитьЭлементы(),
														СтрокаИсточник.Строки,
														КэшСтрокПриемника);
				Иначе
					ДополнитьКоллекциюОбъектаМетаданных(НоваяСтрока.Строки, СтрокаИсточник.Строки, КэшСтрокПриемника);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция КэшСтрокУзлаДерева(КоллекцияМетаданныхПриемник)
	КлючевыеПоля = КолонкиУникальностиОбъектаМетаданных();
	Результат = Новый Соответствие();
	Для Каждого СтрокаКоллекции Из КоллекцияМетаданныхПриемник Цикл
		Если ПустаяСтрока(СтрокаКоллекции.ПолноеИмя) Тогда
			Продолжить;
		КонецЕсли;
		КлючСтроки = КлючСтрокиКэша(КлючевыеПоля, СтрокаКоллекции);
		ДобавитьСтрокуКэша(Результат, КлючСтроки);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьСтрокуКэша(КэшСтрок, КлючСтроки)
	КэшСтрок.Вставить(КлючСтроки, Истина);
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючСтрокиКэша(КлючевыеПоля, СтрокаКоллекции)
	ЗаполнитьЗначенияСвойств(КлючевыеПоля, СтрокаКоллекции);
	КлючСтроки = ЗначениеВСтрокуВнутр(КлючевыеПоля);
	Возврат КлючСтроки;	
КонецФункции

&НаСервереБезКонтекста
Функция КолонкиУникальностиОбъектаМетаданных()

	Результат = Новый Структура;
	Результат.Вставить("Имя");
	Результат.Вставить("ПолноеИмя");
	Результат.Вставить("ИмяЭлементаСтруктурыКонфигурации");
	Результат.Вставить("ЭтоВременнаяСтрока");
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ИнициализироватьОбъектыМетаданных(ДеревоМетаданных, МетаданныеКонфигурации)

	ЭлементыДерева = ДеревоМетаданных.Строки;
	ЭлементыДерева.Очистить();

	КэшЭлементов = Новый Соответствие;
	Для Каждого ОписаниеЭлемента Из СтруктураКонфигурации Цикл
		Узел = УзелМетаданныхДерева(ДеревоМетаданных, ОписаниеЭлемента, КэшЭлементов);
		Если Узел = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЭлементыУзла = Узел.Строки;

		НоваяСтрока = ЭлементыУзла.Добавить();
		Если ОписаниеЭлемента.Имя = ЭлементыСтруктурыКонфигурации.Конфигурация Тогда
			НоваяСтрока.Имя = МетаданныеКонфигурации.Имя;
			НоваяСтрока.Синоним = МетаданныеКонфигурации.Синоним;
			НоваяСтрока.ИмяЭлементаСтруктурыКонфигурации = ОписаниеЭлемента.Имя;
		Иначе
			НоваяСтрока.Имя = ОписаниеЭлемента.Представление;
			НоваяСтрока.ИмяЭлементаСтруктурыКонфигурации = ОписаниеЭлемента.Имя;
		КонецЕсли;
		НоваяСтрока.Картинка = КартинкиЭлементовСтруктурыКонфигурации[ОписаниеЭлемента.Имя];
		
		Если ОписаниеЭлемента.ЕстьКоллекция Тогда
			КоллекцияОбъектовМетаданных = МетаданныеКонфигурации[ОписаниеЭлемента.Имя];
			НоваяСтрока.КоличествоЭлементов = КоличествоЭлементовОбъектовМетаданных(КоллекцияОбъектовМетаданных);
			Если НоваяСтрока.КоличествоЭлементов > 0 Тогда
				НоваяСтрока.ЗаполнитьКоллекциюМетаданных = Истина;
				ЭлементыНовойСтроки = НоваяСтрока.Строки;
				ДобавитьВременнуюСтрокуВДеревоКонфигурации(ЭлементыНовойСтроки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция КоличествоЭлементовОбъектовМетаданных(КоллекцияОбъектовМетаданных)
	
	Результат = КоллекцияОбъектовМетаданных.Количество();
	Если Результат > 0 И УИ_ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(КоллекцияОбъектовМетаданных[0],
																						"Подсистемы") Тогда
		Для Каждого Подсистема Из КоллекцияОбъектовМетаданных Цикл
			Результат = Результат + КоличествоЭлементовОбъектовМетаданных(Подсистема.Подсистемы);
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

// Находит узел дерева метаданных по пути элемента с кэшированием результата поиска.
//
// Параметры:
//   ДеревоМетаданных - ДеревоЗначений - дерево структуры конфигурации
//   ОписаниеЭлемента - Структура - описание элемента конфигурации:
//     * ПутьКЭлементу - Строка - путь к элементу через точку
//     * Имя - Строка - имя элемента структуры конфигурации
//   КэшУзлов - Соответствие из Строка - кэш найденных узлов, ключ - путь к элементу, значение - строка дерева значений
//
// Возвращаемое значение:
//   ДеревоЗначений, СтрокаДереваЗначений, Неопределено - дерева метаданных, если путь пустой
//   СтрокаДереваЗначений - найденный узел дерева метаданных
//   Неопределено - если узел по указанному пути не найден
&НаСервереБезКонтекста
Функция УзелМетаданныхДерева(ДеревоМетаданных, ОписаниеЭлемента, КэшУзлов)

	ЗначениеКэша = КэшУзлов[ОписаниеЭлемента.ПутьКЭлементу];
	Если ЗначениеКэша <> Неопределено Тогда
		Возврат ЗначениеКэша;
	КонецЕсли;

	РезультатПоиска = ДеревоМетаданных;
	ЭлементыУзла = ДеревоМетаданных.Строки;
	ПутьКЭлементу = СтрРазделить(ОписаниеЭлемента.ПутьКЭлементу, ".", Ложь);
	Для Каждого ЧастьПути Из ПутьКЭлементу Цикл
		РезультатПоиска = Неопределено;
		Для Каждого ЭлементУзла Из ЭлементыУзла Цикл
			Если ЭлементУзла.ИмяЭлементаСтруктурыКонфигурации = ЧастьПути Тогда
				РезультатПоиска = ЭлементУзла;
			КонецЕсли;
		КонецЦикла;
		Если РезультатПоиска = Неопределено Тогда
			Прервать;
		КонецЕсли;
		ЭлементыУзла = РезультатПоиска.Строки;
	КонецЦикла;
	Если РезультатПоиска = Неопределено Тогда
		ШаблонОшибки = НСтр("ru = 'Не удалось найти узел ""%1""%2 для элемента структуры конфигурации ""%3"".'");
		Если ПустаяСтрока(ОписаниеЭлемента.ПутьКЭлементу) Тогда
			ОписаниеПути = "";
		Иначе
			ОписаниеПути = СтрШаблон(НСтр("ru = ' из пути ""%1""'"), ОписаниеЭлемента.ПутьКЭлементу);
		КонецЕсли;
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ЧастьПути, ОписаниеПути, ОписаниеЭлемента.Имя);
		УИ_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	Иначе
		КэшУзлов.Вставить(ОписаниеЭлемента.ПутьКЭлементу, РезультатПоиска);
	КонецЕсли;
	Возврат РезультатПоиска;

КонецФункции

// Находит объект метаданных дерева по пути элемента с кэшированием результата поиска.
//
// Параметры:
//   ДеревоМетаданных - ДеревоЗначений - дерево структуры конфигурации
//   ОписаниеЭлемента - Структура - описание элемента конфигурации:
//     * ПутьКЭлементу - Строка - путь к элементу через точку
//     * Имя - Строка - имя элемента структуры конфигурации
//   КэшОбъектов - Соответствие из Строка - кэш найденных объектов, ключ - путь к элементу, значение - строка дерева значений
//   КэшУзлов - Соответствие из Строка - кэш найденных узлов, ключ - путь к элементу, значение - строка дерева значений
//
// Возвращаемое значение:
//   СтрокаДереваЗначений, Неопределено - найденный объект метаданных дерева
//    	Неопределено - если элемент не найден
&НаСервереБезКонтекста
Функция ОбъектМетаданныхДерева(ДеревоМетаданных, ОписаниеЭлемента, КэшОбъектов, КэшУзлов)

	КлючКэша = СтрШаблон("%1.%2", ОписаниеЭлемента.ПутьКЭлементу, ОписаниеЭлемента.Имя);
	ЗначениеКэша = КэшОбъектов[КлючКэша];
	Если ЗначениеКэша <> Неопределено Тогда
		Возврат ЗначениеКэша;
	КонецЕсли;

	СтрокаОбъекта = Неопределено;
	Узел = УзелМетаданныхДерева(ДеревоМетаданных, ОписаниеЭлемента, КэшУзлов);
	Если Узел = Неопределено Тогда
		Возврат СтрокаОбъекта;
	КонецЕсли;
	Для Каждого СтрокаУзла Из Узел.Строки Цикл
		Если СтрокаУзла.ИмяЭлементаСтруктурыКонфигурации = ОписаниеЭлемента.Имя Тогда
			СтрокаОбъекта = СтрокаУзла;
		КонецЕсли;
	КонецЦикла;
	Если СтрокаОбъекта = Неопределено Тогда
		ШаблонОшибки = НСтр("ru = 'Не удалось найти элемент структуры конфигурации ""%1"" по пути ""%2"".'");
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ОписаниеЭлемента.Имя, ОписаниеЭлемента.ПутьКЭлементу);
		УИ_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	Иначе
		КэшОбъектов.Вставить(КлючКэша, СтрокаОбъекта);
	КонецЕсли;
	Возврат СтрокаОбъекта;

КонецФункции

&НаСервере
Процедура ДеревоОбъектовМетаданныхПередРазворачиваниемНаСервере(Знач Строка)

	ТекущиеДанные = ДеревоОбъектовМетаданных.НайтиПоИдентификатору(Строка);
	ЗаполнитьУзелМетаданных(ТекущиеДанные);

КонецПроцедуры

&НаСервере
Функция ЭлементСтруктурыКонфигурации(ИмяЭлемента)
	
	Результат = Неопределено;
	СтруктураПоиска = Новый Структура("Имя", ИмяЭлемента);
	НайденныеСтроки = СтруктураКонфигурации.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Результат = НайденныеСтроки[0];
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьУзелМетаданных(Узел)

	ЭлементыУзла = Узел.ПолучитьЭлементы();
	НайтиИУдалитьВременнуюСтрокуВДеревеКонфигурации(ЭлементыУзла);
	ЭлементСтруктурыКонфигурации = ЭлементСтруктурыКонфигурации(Узел.ИмяЭлементаСтруктурыКонфигурации);
	ДанныеПоОтборуКонфигураций = ДанныеПоОтборуКонфигураций();
	КэшСтрокПриемника = КэшСтрокУзлаДерева(ЭлементыУзла);
	Для Каждого СтрокаДанных Из ДанныеПоОтборуКонфигураций Цикл
		КоллекцияОбъектов = ОбъектМетаданныхДерева(СтрокаДанных.ДеревоОбъектовМетаданных,
												   ЭлементСтруктурыКонфигурации,
												   СтрокаДанных.КэшЭлементов,
												   СтрокаДанных.КэшУзлов);
		Если КоллекцияОбъектов.ЗаполнитьКоллекциюМетаданных Тогда
			ЗаполнитьКоллекциюОбъектовМетаданных(КоллекцияОбъектов, СтрокаДанных.Метаданные);
			СохранитьДеревоМетаданныхКонфигурации(СтрокаДанных);
			ДополнитьКоллекциюОбъектаМетаданных(ЭлементыУзла, КоллекцияОбъектов.Строки, КэшСтрокПриемника);
		КонецЕсли;
	КонецЦикла;
	Узел.КоличествоЭлементов = КэшСтрокПриемника.Количество();
	Узел.ЗаполнитьКоллекциюМетаданных = Ложь;

КонецПроцедуры

&НаСервере
Процедура СохранитьДеревоМетаданныхКонфигурации(СтрокаДанныхПоОтборуКонфигураций)

	СтрокаКонфигурации = ДеревоОтбораКонфигураций.НайтиПоИдентификатору(СтрокаДанныхПоОтборуКонфигураций.Идентификатор);
	Если СтрокаКонфигурации = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не найдена строка конфигурации по идентификатору %1.'"),
								СтрокаДанныхПоОтборуКонфигураций.Идентификатор);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	Если ЭтоАдресВременногоХранилища(СтрокаКонфигурации.АдресДереваОбъектовМетаданных) Тогда
		УдалитьИзВременногоХранилища(СтрокаКонфигурации.АдресДереваОбъектовМетаданных);
	КонецЕсли;
	ДеревоОбъектов = СтрокаДанныхПоОтборуКонфигураций.ДеревоОбъектовМетаданных;
	СтрокаКонфигурации.АдресДереваОбъектовМетаданных = ПоместитьВоВременноеХранилище(ДеревоОбъектов,
																					 УникальныйИдентификатор);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоллекциюОбъектовМетаданных(КоллекцияОбъектов, МетаданныеКонфигурации, ВидОбъекта = Неопределено)

	Если ВидОбъекта = Неопределено Тогда
		ВидОбъекта = КоллекцияОбъектов.ИмяЭлементаСтруктурыКонфигурации;
	КонецЕсли;
	ЭлементыКоллекции = КоллекцияОбъектов.Строки;
	НайтиИУдалитьВременнуюСтрокуВДеревеКонфигурации(ЭлементыКоллекции);
	Для Каждого ОбъектМетаданных Из МетаданныеКонфигурации[ВидОбъекта] Цикл
		НоваяСтрока = ДобавитьОбъектМетаданныхВКоллекцию(ЭлементыКоллекции, ОбъектМетаданных, ВидОбъекта);
		Если ВидОбъекта = ЭлементыСтруктурыКонфигурации.Подсистемы Тогда
			ЗаполнитьКоллекциюОбъектовМетаданных(НоваяСтрока, ОбъектМетаданных, ВидОбъекта);
		КонецЕсли;
	КонецЦикла;
	КоллекцияОбъектов.ЗаполнитьКоллекциюМетаданных = Ложь;

КонецПроцедуры

&НаСервере
Функция ДобавитьОбъектМетаданныхВКоллекцию(ЭлементыКоллекции, ОбъектМетаданных, ВидОбъекта)

	НовыйЭлемент = ЭлементыКоллекции.Добавить();
	НовыйЭлемент.Имя = ОбъектМетаданных.Имя;
	НовыйЭлемент.Синоним = ОбъектМетаданных.Синоним;
	НовыйЭлемент.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	НовыйЭлемент.Картинка = КартинкиЭлементовСтруктурыКонфигурации[ВидОбъекта];
	Возврат НовыйЭлемент;

КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьВременнуюСтрокуВДеревоКонфигурации(ЭлементыУзла)

	НоваяСтрока = ЭлементыУзла.Добавить();
	НоваяСтрока.ЭтоВременнаяСтрока = Истина;

КонецПроцедуры

// Удаляет временную строку в дереве конфигурации, если она есть в элементах узла.
// 
// Параметры:
//  ЭлементыУзла - ДанныеФормыКоллекцияЭлементовДерева, КоллекцияСтрокДереваЗначений - Элементы узла
&НаСервереБезКонтекста
Процедура НайтиИУдалитьВременнуюСтрокуВДеревеКонфигурации(ЭлементыУзла)

	Для Каждого Элемент Из ЭлементыУзла Цикл
		Если Элемент.ЭтоВременнаяСтрока Тогда
			ЭлементыУзла.Удалить(Элемент);
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруКонфигурации()

	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Конфигурация, НСтр("ru = 'Конфигурация'"), , Ложь);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Общие, НСтр("ru = 'Общие'"), , Ложь);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Подсистемы,
										НСтр("ru = 'Подсистемы'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ОбщиеМодули,
										НСтр("ru = 'Общие модули'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ПараметрыСеанса,
										НСтр("ru = 'Параметры сеанса'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Роли,
										НСтр("ru = 'Роли'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ОбщиеРеквизиты,
										НСтр("ru = 'Общие реквизиты'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ПланыОбмена,
										НСтр("ru = 'Планы обмена'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.КритерииОтбора,
										НСтр("ru = 'Критерии отбора'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ПодпискиНаСобытия,
										НСтр("ru = 'Подписки на события'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.РегламентныеЗадания,
										НСтр("ru = 'Регламентные задания'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Боты,
										НСтр("ru = 'Боты'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ФункциональныеОпции,
										НСтр("ru = 'Функциональные опции'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ПараметрыФункциональныхОпций,
										НСтр("ru = 'Параметры функциональных опций'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ОпределяемыеТипы,
										НСтр("ru = 'Определяемые типы'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ХранилищаНастроек,
										НСтр("ru = 'Хранилища настроек'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ОбщиеКоманды,
										НСтр("ru = 'Общие команды'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ГруппыКоманд,
										НСтр("ru = 'Группы команд'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ОбщиеФормы,
										НСтр("ru = 'Общие формы'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ОбщиеМакеты,
										НСтр("ru = 'Общие макеты'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ОбщиеКартинки,
										НСтр("ru = 'Общие картинки'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ПакетыXDTO,
										НСтр("ru = 'XDTO-пакеты'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.WebСервисы,
										НСтр("ru = 'Web-сервисы'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.HTTPСервисы,
										НСтр("ru = 'HTTP-сервисы'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.WSСсылки,
										НСтр("ru = 'WS-ссылки'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.WebSocketКлиенты,
										НСтр("ru = 'WebSocket-клиенты'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.СервисыИнтеграции,
										НСтр("ru = 'Сервисы интеграции'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ЦветаПалитры,
										НСтр("ru = 'Цвета палитры'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ЭлементыСтиля,
										НСтр("ru = 'Элементы стиля'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Стили,
										НСтр("ru = 'Стили'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Языки,
										НСтр("ru = 'Языки'"),
										ЭлементыСтруктурыКонфигурации.Общие);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Константы, НСтр("ru = 'Константы'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Справочники, НСтр("ru = 'Справочники'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Документы, НСтр("ru = 'Документы'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.НумераторыДокументов,
										НСтр("ru = 'Нумераторы'"),
										ЭлементыСтруктурыКонфигурации.Документы);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Последовательности,
										НСтр("ru = 'Последовательности'"),
										ЭлементыСтруктурыКонфигурации.Документы);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ЖурналыДокументов,
										НСтр("ru = 'Журналы документов'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Перечисления, НСтр("ru = 'Перечисления'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Отчеты, НСтр("ru = 'Отчеты'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Обработки, НСтр("ru = 'Обработки'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ПланыВидовХарактеристик,
										НСтр("ru = 'Планы видов характеристик'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ПланыСчетов, НСтр("ru = 'Планы счетов'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ПланыВидовРасчета,
										НСтр("ru = 'Планы видов расчета'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.РегистрыСведений,
										НСтр("ru = 'Регистры сведений'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.РегистрыНакопления,
										НСтр("ru = 'Регистры накопления'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.РегистрыБухгалтерии,
										НСтр("ru = 'Регистры бухгалтерии'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.РегистрыРасчета, НСтр("ru = 'Регистры расчета'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.БизнесПроцессы, НСтр("ru = 'Бизнес-процессы'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.Задачи, НСтр("ru = 'Задачи'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктурыКонфигурации.ВнешниеИсточникиДанных,
										НСтр("ru = 'Внешние источники данных'"));

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуСтруктурыКонфигурации(Имя, Представление, ПутьКЭлементу = "", ЕстьКоллекция = Истина)

	// Проверка на существование в текущей информационной базе этого метаданного
	Если ЕстьКоллекция И Не УИ_ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Метаданные, Имя) Тогда
		Возврат;
	КонецЕсли;

	НоваяСтрока = СтруктураКонфигурации.Добавить();
	НоваяСтрока.Имя = Имя;
	НоваяСтрока.Представление = Представление;
	НоваяСтрока.ПутьКЭлементу = ПутьКЭлементу;
	НоваяСтрока.ЕстьКоллекция = ЕстьКоллекция;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭлементыСтруктурыКонфигурации()

	Результат = Новый Структура;
	Результат.Вставить("Конфигурация", "Конфигурация");
	Результат.Вставить("Общие", "Общие");
	Результат.Вставить("Подсистемы", "Подсистемы");
	Результат.Вставить("ОбщиеМодули", "ОбщиеМодули");
	Результат.Вставить("ПараметрыСеанса", "ПараметрыСеанса");
	Результат.Вставить("Роли", "Роли");
	Результат.Вставить("ОбщиеРеквизиты", "ОбщиеРеквизиты");
	Результат.Вставить("ПланыОбмена", "ПланыОбмена");
	Результат.Вставить("КритерииОтбора", "КритерииОтбора");
	Результат.Вставить("ПодпискиНаСобытия", "ПодпискиНаСобытия");
	Результат.Вставить("РегламентныеЗадания", "РегламентныеЗадания");
	Результат.Вставить("Боты", "Боты");
	Результат.Вставить("ФункциональныеОпции", "ФункциональныеОпции");
	Результат.Вставить("ПараметрыФункциональныхОпций", "ПараметрыФункциональныхОпций");
	Результат.Вставить("ОпределяемыеТипы", "ОпределяемыеТипы");
	Результат.Вставить("ХранилищаНастроек", "ХранилищаНастроек");
	Результат.Вставить("ОбщиеКоманды", "ОбщиеКоманды");
	Результат.Вставить("ГруппыКоманд", "ГруппыКоманд");
	Результат.Вставить("ОбщиеФормы", "ОбщиеФормы");
	Результат.Вставить("ОбщиеМакеты", "ОбщиеМакеты");
	Результат.Вставить("ОбщиеКартинки", "ОбщиеКартинки");
	Результат.Вставить("ПакетыXDTO", "ПакетыXDTO");
	Результат.Вставить("WebСервисы", "WebСервисы");
	Результат.Вставить("HTTPСервисы", "HTTPСервисы");
	Результат.Вставить("WSСсылки", "WSСсылки");
	Результат.Вставить("WebSocketКлиенты", "WebSocketКлиенты");
	Результат.Вставить("СервисыИнтеграции", "СервисыИнтеграции");
	Результат.Вставить("ЦветаПалитры", "ЦветаПалитры");
	Результат.Вставить("ЭлементыСтиля", "ЭлементыСтиля");
	Результат.Вставить("Стили", "Стили");
	Результат.Вставить("Языки", "Языки");
	Результат.Вставить("Константы", "Константы");
	Результат.Вставить("Справочники", "Справочники");
	Результат.Вставить("Документы", "Документы");
	Результат.Вставить("НумераторыДокументов", "НумераторыДокументов");
	Результат.Вставить("Последовательности", "Последовательности");
	Результат.Вставить("ЖурналыДокументов", "ЖурналыДокументов");
	Результат.Вставить("Перечисления", "Перечисления");
	Результат.Вставить("Отчеты", "Отчеты");
	Результат.Вставить("Обработки", "Обработки");
	Результат.Вставить("ПланыВидовХарактеристик", "ПланыВидовХарактеристик");
	Результат.Вставить("ПланыСчетов", "ПланыСчетов");
	Результат.Вставить("ПланыВидовРасчета", "ПланыВидовРасчета");
	Результат.Вставить("РегистрыСведений", "РегистрыСведений");
	Результат.Вставить("РегистрыНакопления", "РегистрыНакопления");
	Результат.Вставить("РегистрыБухгалтерии", "РегистрыБухгалтерии");
	Результат.Вставить("РегистрыРасчета", "РегистрыРасчета");
	Результат.Вставить("БизнесПроцессы", "БизнесПроцессы");
	Результат.Вставить("Задачи", "Задачи");
	Результат.Вставить("ВнешниеИсточникиДанных", "ВнешниеИсточникиДанных");
	Возврат Результат;

КонецФункции

// Возвращаемое значение:
//   Соответствие из КлючИЗначение:
//     * Ключ - Строка - имя элемента структуры конфигурации
//     * Значение - Картинка
&НаСервере
Функция КартинкиЭлементовСтруктурыКонфигурации()

	Результат = Новый Соответствие();
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.ОбщиеРеквизиты, БиблиотекаКартинок.Реквизит);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.ПланыОбмена, БиблиотекаКартинок.ПланОбмена);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.КритерииОтбора, БиблиотекаКартинок.КритерийОтбора);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.РегламентныеЗадания, БиблиотекаКартинок.РегламентноеЗадание);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.ХранилищаНастроек, БиблиотекаКартинок.ХранилищеНастроек);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.ОбщиеФормы, БиблиотекаКартинок.Форма);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.ОбщиеКартинки, БиблиотекаКартинок.Картинка);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.Константы, БиблиотекаКартинок.Константа);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.Справочники, БиблиотекаКартинок.Справочник);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.Документы, БиблиотекаКартинок.Документ);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.ЖурналыДокументов, БиблиотекаКартинок.ЖурналДокументов);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.Перечисления, БиблиотекаКартинок.Перечисление);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.Отчеты, БиблиотекаКартинок.Отчет);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.Обработки, БиблиотекаКартинок.Обработка);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.ПланыВидовХарактеристик, БиблиотекаКартинок.ПланВидовХарактеристик);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.ПланыСчетов, БиблиотекаКартинок.ПланСчетов);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.ПланыВидовРасчета, БиблиотекаКартинок.ПланВидовРасчета);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.РегистрыСведений, БиблиотекаКартинок.РегистрСведений);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.РегистрыНакопления, БиблиотекаКартинок.РегистрНакопления);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.РегистрыБухгалтерии, БиблиотекаКартинок.РегистрБухгалтерии);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.РегистрыРасчета, БиблиотекаКартинок.РегистрРасчета);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.БизнесПроцессы, БиблиотекаКартинок.БизнесПроцесс);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.Задачи, БиблиотекаКартинок.Задача);
	Результат.Вставить(ЭлементыСтруктурыКонфигурации.ВнешниеИсточникиДанных, БиблиотекаКартинок.ВнешнийИсточникДанных);
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоОтбораКонфигураций()

	ВерхнийУровень = ДеревоОтбораКонфигураций.ПолучитьЭлементы();
	Элемент = ВерхнийУровень.Добавить();
	Элемент.Имя = Метаданные.Имя;
	Элемент.Синоним = Метаданные.Синоним;
	Элемент.Пометка = 1;
	Элемент.ЭтоТекущаяБазаДанных = Истина;

	ЭлементыРасширений = Элемент.ПолучитьЭлементы();
	АктивныеРасширения = АктивныеРасширения();
	Для Каждого Расширение Из АктивныеРасширения Цикл
		ЭлементРасширения = ЭлементыРасширений.Добавить();
		ЭлементРасширения.Имя = Расширение.Имя;
		ЭлементРасширения.Синоним = Расширение.Синоним;
		ЭлементРасширения.Пометка = 1;
		ЭлементРасширения.ЭтоТекущаяБазаДанных = Истина;
	КонецЦикла;

КонецПроцедуры

// Возвращает расширение по имени.
// 
// Параметры:
//  СписокРасширений - Массив из РасширениеКонфигурации - Список расширений
//  ИмяРасширения - Строка - Имя расширения
// 
// Возвращаемое значение:
//  Неопределено, РасширениеКонфигурации - Найти расширение по имени
&НаСервереБезКонтекста
Функция НайтиРасширениеПоИмени(СписокРасширений, ИмяРасширения)

	Результат = Неопределено;
	Для Каждого Расширение Из СписокРасширений Цикл
		Если Расширение.Имя = ИмяРасширения Тогда
			Результат = Расширение;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Возвращает активные расширения текущего сеанса.
// 
// Параметры:
//  ИмяРасширения - Неопределено, Строка - Имя расширения, если указан, то вернется расширение по этому имени
// 
// Возвращаемое значение:
//  Массив из РасширениеКонфигурации - Активные расширения
&НаСервереБезКонтекста
Функция АктивныеРасширения(ИмяРасширения = Неопределено)

	Перем СтруктураПоиска;
	Если ИмяРасширения <> Неопределено Тогда
		СтруктураПоиска = Новый Структура("Имя", ИмяРасширения);
	КонецЕсли;
	АктивныеРасширения = РасширенияКонфигурации.Получить(СтруктураПоиска, ИсточникРасширенийКонфигурации.СеансАктивные);
	Возврат АктивныеРасширения;

КонецФункции

&НаСервере
Функция АдресДереваОтбораКонфигураций()

	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоОтбораКонфигураций");
	Адрес = ПоместитьВоВременноеХранилище(ДеревоЗначений);
	Возврат Адрес;

КонецФункции

&НаКлиенте
Процедура ОткрытьОтборКонфигурацийЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОткрытьОтборКонфигурацийЗавершениеНаСервере(Результат);

КонецПроцедуры

&НаСервере
Процедура ОткрытьОтборКонфигурацийЗавершениеНаСервере(Результат)

	Дерево = ПолучитьИзВременногоХранилища(Результат);
	УдалитьИзВременногоХранилища(Результат);
	ЗначениеВДанныеФормы(Дерево, ДеревоОтбораКонфигураций);
	ЗаполнитьДеревоОбъектовМетаданных();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКнопокДереваОбъектов()
	
	ТекущиеДанные = Элементы.ДеревоОбъектовМетаданных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоОбъектМетаданных = ЗначениеЗаполнено(ТекущиеДанные.ПолноеИмя);
	
	КомандыДляСтрокДерева = Новый Массив;
	КомандыДляСтрокДерева.Добавить("ОткрытьСвойстваОбъектаМетаданных");
	КомандыДляСтрокДерева.Добавить("ОткрытьОбъектСписокМетаданных");
	КомандыДляСтрокДерева.Добавить("ОткрытьДинамическийСписок");
	КомандыДляСтрокДерева.Добавить("ДобавитьВИзбранные");
	КомандыДляСтрокДерева.Добавить("УдалитьИзИзбранных");
	Для Каждого ИмяКоманды Из КомандыДляСтрокДерева Цикл
		ИмяДополнительнойКоманды = СтрШаблон("%1КонтекстноеМеню", ИмяКоманды);
		Элементы[ИмяКоманды].Доступность = ЭтоОбъектМетаданных;
		Элементы[ИмяДополнительнойКоманды].Доступность = ЭтоОбъектМетаданных;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзбранныеОбъектыМетаданныхВДеревеОбъектов(ДеревоОбъектов)

	УзелИзбранные = УзелИзбранные(ДеревоОбъектов);
	Если УзелИзбранные = Неопределено Тогда
		ЭлементыДерева = ДеревоОбъектов.Строки;
		УзелИзбранные = ЭлементыДерева.Вставить(0);
		УзелИзбранные.Имя = ИмяУзлаИзбранные();
		УзелИзбранные.КоличествоЭлементов = ИзбранныеОбъектыМетаданных.Количество();
	КонецЕсли;

	ЭлементыУзла = УзелИзбранные.Строки;
	Для Каждого ОписаниеИзбранного Из ИзбранныеОбъектыМетаданных Цикл
		НовыйЭлемент = ЭлементыУзла.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОписаниеИзбранного);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УзелИзбранные(ДеревоОбъектов)

	ИмяУзлаИзбранные = ИмяУзлаИзбранные();
	Результат = Неопределено;
	Если ТипЗнч(ДеревоОбъектов) = Тип("ДанныеФормыДерево") Тогда
		ЭлементыДерева = ДеревоОбъектов.ПолучитьЭлементы();
	Иначе
		#Если Сервер Тогда
			ЭлементыДерева = ДеревоОбъектов.Строки;
		#Иначе
			Возврат Результат;
		#КонецЕсли
	КонецЕсли;
	Для Каждого Элемент Из ЭлементыДерева Цикл
		Если Элемент.Имя = ИмяУзлаИзбранные Тогда
			Результат = Элемент;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяУзлаИзбранные()
	Возврат НСтр("ru = 'Избранные'");
КонецФункции

&НаКлиенте
Процедура СвернутьДеревоОбъектовРекурсивно(ЭлементДерева, КоллекцияДанныхДерева)

	Для Каждого СтрокаДерева Из КоллекцияДанныхДерева Цикл
		ЭлементыДочерние = СтрокаДерева.ПолучитьЭлементы();
		Если ЭлементыДочерние.Количество() > 0 Тогда
			СвернутьДеревоОбъектовРекурсивно(ЭлементДерева, ЭлементыДочерние);
		КонецЕсли;
		Идентификатор = СтрокаДерева.ПолучитьИдентификатор();
		Если ЭлементДерева.Развернут(Идентификатор) Тогда
			ЭлементДерева.Свернуть(Идентификатор);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбщуюКомандуИнструментов(Команда)
	УИ_ОбщегоНазначенияКлиент.Подключаемый_ВыполнитьОбщуюКомандуИнструментов(ЭтотОбъект, Команда);
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#Если Сервер Тогда
	ЭлементыСтруктурыКонфигурации = ЭлементыСтруктурыКонфигурации();
	КартинкиЭлементовСтруктурыКонфигурации = КартинкиЭлементовСтруктурыКонфигурации();
#КонецЕсли

#КонецОбласти