#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСтруктуруКонфигурации();
	ЗаполнитьОбъектыМетаданных(ДеревоОбъектовМетаданных, Метаданные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоОбъектовМетаданных

&НаКлиенте
Процедура ДеревоОбъектовМетаданныхПередРазворачиванием(Элемент, Строка, Отказ)

	ТекущиеДанные = ДеревоОбъектовМетаданных.НайтиПоИдентификатору(Строка);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.ЗаполнитьКоллекциюМетаданных Тогда
		ДеревоОбъектовМетаданныхПередРазворачиваниемНаСервере(Строка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОбъектыМетаданных(ДеревоМетаданных, МетаданныеКонфигурации)

	КэшЭлементов = Новый Соответствие;
	Для Каждого ОписаниеЭлемента Из СтруктураКонфигурации Цикл
		Узел = УзелМетаданных(ДеревоМетаданных, ОписаниеЭлемента, КэшЭлементов);
		Если Узел = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЭлементыУзла = Узел.ПолучитьЭлементы();

		НоваяСтрока = ЭлементыУзла.Добавить();
		НоваяСтрока.Имя = ОписаниеЭлемента.Представление;
		НоваяСтрока.ИмяЭлементаСтруктурыКонфигурации = ОписаниеЭлемента.Имя;
		Если ОписаниеЭлемента.ЕстьКоллекция Тогда
			НоваяСтрока.ЗаполнитьКоллекциюМетаданных = Истина;
			НоваяСтрока.КоличествоЭлементов = МетаданныеКонфигурации[ОписаниеЭлемента.Имя].Количество();
			Если НоваяСтрока.КоличествоЭлементов > 0 Тогда
				ЭлементыНовойСтроки = НоваяСтрока.ПолучитьЭлементы();
				ДобавитьВременнуюСтрокуВДеревоКонфигурации(ЭлементыНовойСтроки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Находит узел дерева метаданных по пути элемента с кэшированием результата поиска.
//
// Параметры:
//   ДеревоМетаданных - ДанныеФормыДерево - дерево структуры конфигурации
//   ОписаниеЭлемента - Структура - описание элемента конфигурации:
//     * ПутьКЭлементу - Строка - путь к элементу через точку
//     * Имя - Строка - имя элемента структуры конфигурации
//   КэшЭлементов - Соответствие из Строка - кэш найденных узлов, ключ - путь к элементу, значение - строка дерева значений
//
// Возвращаемое значение:
//   ДанныеФормыДерево - дерева метаданных, если путь пустой
//   ДанныеФормыЭлементДерева - найденный узел дерева метаданных
//   Неопределено - если узел по указанному пути не найден
&НаСервереБезКонтекста
Функция УзелМетаданных(ДеревоМетаданных, ОписаниеЭлемента, КэшЭлементов)

	ЗначениеКэша = КэшЭлементов[ОписаниеЭлемента.ПутьКЭлементу];
	Если ЗначениеКэша <> Неопределено Тогда
		Возврат ЗначениеКэша;
	КонецЕсли;

	РезультатПоиска = ДеревоМетаданных;
	ЭлементыУзла = ДеревоМетаданных.ПолучитьЭлементы();
	ПутьКЭлементу = СтрРазделить(ОписаниеЭлемента.ПутьКЭлементу, ".", Ложь);
	Для Каждого ЧастьПути Из ПутьКЭлементу Цикл
		РезультатПоиска = Неопределено;
		Для Каждого ЭлементУзла Из ЭлементыУзла Цикл
			Если ЭлементУзла.ИмяЭлементаСтруктурыКонфигурации = ЧастьПути Тогда
				РезультатПоиска = ЭлементУзла;
			КонецЕсли;
		КонецЦикла;
		Если РезультатПоиска = Неопределено Тогда
			Прервать;
		КонецЕсли;
		ЭлементыУзла = РезультатПоиска.ПолучитьЭлементы();
	КонецЦикла;
	Если РезультатПоиска = Неопределено Тогда
		ШаблонОшибки = НСтр("ru = 'Не удалось найти узел ""%1"" из пути ""%2"" для элемента структуры конфигурации ""%3"".'");
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ЧастьПути, ОписаниеЭлемента.ПутьКЭлементу, ОписаниеЭлемента.Имя);
		УИ_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	Иначе
		КэшЭлементов.Вставить(ОписаниеЭлемента.ПутьКЭлементу, РезультатПоиска);
	КонецЕсли;
	Возврат РезультатПоиска;

КонецФункции

&НаСервере
Процедура ДеревоОбъектовМетаданныхПередРазворачиваниемНаСервере(Знач Строка)
	
	ТекущиеДанные = ДеревоОбъектовМетаданных.НайтиПоИдентификатору(Строка);
	ЭлементыУзла = ТекущиеДанные.ПолучитьЭлементы();
	НайтиИУдалитьВременнуюСтрокуВДеревеКонфигурации(ЭлементыУзла);
	Для Каждого Элемент Из Метаданные[ТекущиеДанные.ИмяЭлементаСтруктурыКонфигурации] Цикл
		НовыйЭлемент = ЭлементыУзла.Добавить();
		НовыйЭлемент.Имя = Элемент.Имя;
		НовыйЭлемент.Синоним = Элемент.Синоним;
	КонецЦикла;
	ТекущиеДанные.ЗаполнитьКоллекциюМетаданных = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьВременнуюСтрокуВДеревоКонфигурации(ЭлементыУзла)
	
	НоваяСтрока = ЭлементыУзла.Добавить();
	НоваяСтрока.Имя = ИдентификаторВременнойСтроки();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НайтиИУдалитьВременнуюСтрокуВДеревеКонфигурации(ЭлементыУзла)
	
	ИдентификаторВременнойСтроки = ИдентификаторВременнойСтроки();
	Для Каждого Элемент Из ЭлементыУзла Цикл
		Если Элемент.Имя = ИдентификаторВременнойСтроки Тогда
			ЭлементыУзла.Удалить(Элемент);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторВременнойСтроки()
	Возврат "<Данные заполняются...>";
КонецФункции

&НаСервере
Процедура ЗаполнитьСтруктуруКонфигурации()

	ЭлементыСтруктуры = ЭлементыСтруктурыКонфигурации();
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Конфигурация, НСтр("ru = 'Конфигурация'"), , Ложь);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Общие, НСтр("ru = 'Общие'"), , Ложь);
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Подсистемы, НСтр("ru = 'Подсистемы'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ОбщиеМодули, НСтр("ru = 'Общие модули'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ПараметрыСеанса, НСтр("ru = 'Параметры сеанса'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Роли, НСтр("ru = 'Роли'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ОбщиеРеквизиты, НСтр("ru = 'Общие реквизиты'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ПланыОбмена, НСтр("ru = 'Планы обмена'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.КритерииОтбора, НСтр("ru = 'Критерии отбора'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ПодпискиНаСобытия, НСтр("ru = 'Подписки на события'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.РегламентныеЗадания, НСтр("ru = 'Регламентные задания'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Боты, НСтр("ru = 'Боты'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ФункциональныеОпции, НСтр("ru = 'Функциональные опции'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ПараметрыФункциональныхОпций,
										НСтр("ru = 'Параметры функциональных опций'"),
										"Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ОпределяемыеТипы, НСтр("ru = 'Определяемые типы'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ХранилищаНастроек, НСтр("ru = 'Хранилища настроек'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ОбщиеКоманды, НСтр("ru = 'Общие команды'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ГруппыКоманд, НСтр("ru = 'Группы команд'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ОбщиеФормы, НСтр("ru = 'Общие формы'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ОбщиеМакеты, НСтр("ru = 'Общие макеты'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ОбщиеКартинки, НСтр("ru = 'Общие картинки'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ПакетыXDTO, НСтр("ru = 'XDTO-пакеты'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.WebСервисы, НСтр("ru = 'Web-сервисы'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.HTTPСервисы, НСтр("ru = 'HTTP-сервисы'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.WSСсылки, НСтр("ru = 'WS-ссылки'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.WebSocketКлиенты, НСтр("ru = 'WebSocket-клиенты'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.СервисыИнтеграции, НСтр("ru = 'Сервисы интеграции'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ЦветаПалитры, НСтр("ru = 'Цвета палитры'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ЭлементыСтруктурыСтиля, НСтр("ru = 'ЭлементыСтруктуры стиля'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Стили, НСтр("ru = 'Стили'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Языки, НСтр("ru = 'Языки'"), "Общие");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Константы, НСтр("ru = 'Константы'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Справочники, НСтр("ru = 'Справочники'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Документы, НСтр("ru = 'Документы'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.НумераторыДокументов, НСтр("ru = 'Нумераторы'"), "Документы");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Последовательности, НСтр("ru = 'Последовательности'"), "Документы");
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ЖурналыДокументов, НСтр("ru = 'Журналы документов'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Перечисления, НСтр("ru = 'Перечисления'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Отчеты, НСтр("ru = 'Отчеты'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Обработки, НСтр("ru = 'Обработки'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ПланыВидовХарактеристик, НСтр("ru = 'Планы видов характеристик'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ПланыСчетов, НСтр("ru = 'Планы счетов'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ПланыВидовРасчета, НСтр("ru = 'Планы видов расчета'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.РегистрыСведений, НСтр("ru = 'Регистры сведений'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.РегистрыНакопления, НСтр("ru = 'Регистры накопления'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.РегистрыБухгалтерии, НСтр("ru = 'Регистры бухгалтерии'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.РегистрыРасчета, НСтр("ru = 'Регистры расчета'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.БизнесПроцессы, НСтр("ru = 'Бизнес-процессы'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.Задачи, НСтр("ru = 'Задачи'"));
	ДобавитьСтрокуСтруктурыКонфигурации(ЭлементыСтруктуры.ВнешниеИсточникиДанных, НСтр("ru = 'Внешние источники данных'"));

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуСтруктурыКонфигурации(Имя, Представление, ПутьКЭлементу = "", ЕстьКоллекция = Истина)

	// Проверка на существование в текущей информационной базе этого метаданного
	Если ЕстьКоллекция И Не УИ_ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Метаданные, Имя) Тогда
		Возврат;
	КонецЕсли;

	НоваяСтрока = СтруктураКонфигурации.Добавить();
	НоваяСтрока.Имя = Имя;
	НоваяСтрока.Представление = Представление;
	НоваяСтрока.ПутьКЭлементу = ПутьКЭлементу;
	НоваяСтрока.ЕстьКоллекция = ЕстьКоллекция;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭлементыСтруктурыКонфигурации()
	
	Результат = Новый Структура;
	Результат.Вставить("Конфигурация", "Конфигурация");
	Результат.Вставить("Общие", "Общие");
	Результат.Вставить("Подсистемы", "Подсистемы");
	Результат.Вставить("ОбщиеМодули", "ОбщиеМодули");
	Результат.Вставить("ПараметрыСеанса", "ПараметрыСеанса");
	Результат.Вставить("Роли", "Роли");
	Результат.Вставить("ОбщиеРеквизиты", "ОбщиеРеквизиты");
	Результат.Вставить("ПланыОбмена", "ПланыОбмена");
	Результат.Вставить("КритерииОтбора", "КритерииОтбора");
	Результат.Вставить("ПодпискиНаСобытия", "ПодпискиНаСобытия");
	Результат.Вставить("РегламентныеЗадания", "РегламентныеЗадания");
	Результат.Вставить("Боты", "Боты");
	Результат.Вставить("ФункциональныеОпции", "ФункциональныеОпции");
	Результат.Вставить("ПараметрыФункциональныхОпций", "ПараметрыФункциональныхОпций");
	Результат.Вставить("ОпределяемыеТипы", "ОпределяемыеТипы");
	Результат.Вставить("ХранилищаНастроек", "ХранилищаНастроек");
	Результат.Вставить("ОбщиеКоманды", "ОбщиеКоманды");
	Результат.Вставить("ГруппыКоманд", "ГруппыКоманд");
	Результат.Вставить("ОбщиеФормы", "ОбщиеФормы");
	Результат.Вставить("ОбщиеМакеты", "ОбщиеМакеты");
	Результат.Вставить("ОбщиеКартинки", "ОбщиеКартинки");
	Результат.Вставить("ПакетыXDTO", "ПакетыXDTO");
	Результат.Вставить("WebСервисы", "WebСервисы");
	Результат.Вставить("HTTPСервисы", "HTTPСервисы");
	Результат.Вставить("WSСсылки", "WSСсылки");
	Результат.Вставить("WebSocketКлиенты", "WebSocketКлиенты");
	Результат.Вставить("СервисыИнтеграции", "СервисыИнтеграции");
	Результат.Вставить("ЦветаПалитры", "ЦветаПалитры");
	Результат.Вставить("ЭлементыСтиля", "ЭлементыСтиля");
	Результат.Вставить("Стили", "Стили");
	Результат.Вставить("Языки", "Языки");
	Результат.Вставить("Константы", "Константы");
	Результат.Вставить("Справочники", "Справочники");
	Результат.Вставить("Документы", "Документы");
	Результат.Вставить("НумераторыДокументов", "НумераторыДокументов");
	Результат.Вставить("Последовательности", "Последовательности");
	Результат.Вставить("ЖурналыДокументов", "ЖурналыДокументов");
	Результат.Вставить("Перечисления", "Перечисления");
	Результат.Вставить("Отчеты", "Отчеты");
	Результат.Вставить("Обработки", "Обработки");
	Результат.Вставить("ПланыВидовХарактеристик", "ПланыВидовХарактеристик");
	Результат.Вставить("ПланыСчетов", "ПланыСчетов");
	Результат.Вставить("ПланыВидовРасчета", "ПланыВидовРасчета");
	Результат.Вставить("РегистрыСведений", "РегистрыСведений");
	Результат.Вставить("РегистрыНакопления", "РегистрыНакопления");
	Результат.Вставить("РегистрыБухгалтерии", "РегистрыБухгалтерии");
	Результат.Вставить("РегистрыРасчета", "РегистрыРасчета");
	Результат.Вставить("БизнесПроцессы", "БизнесПроцессы");
	Результат.Вставить("Задачи", "Задачи");
	Результат.Вставить("ВнешниеИсточникиДанных", "ВнешниеИсточникиДанных");
	Возврат Результат;
	
КонецФункции

#КонецОбласти
